{
    "about": {
        "title": "What is Scrum?",
        "subtitle": "",
        "description": "",
        "content": "<p>Scrum is a lightweight, yet incredibly powerful set of values, principles and practicies.</p><p>It works by breaking apart large products and services into small pieces, that can be completed, and potentially delivered, by cross-functional team in short, limited timeframes.</p>Adopting evidence-based empirical approach Scrum acknowledges that a product or problem cannot be defined or understood upfront, as requirements are bound to change. In it's essence lies focus on responding to changing or new requrements, as well as quick delivery and adaptation to new market conditions and technologies."},
    "artifacts": {
        "title": "Arfifacts",
        "subtitle": "The three items you need to keep track of!",
        "description": "Items that are the basis of Scrum workflow and methodology.",
        "content": "<p>There are three Scrum Arctifacts: Product Backlog, Sprint Backlog and Increment. Each one represents some work or value, and are created with transparency in mind, so that everyone in the Scrum Team understands them. All of these Artifacts also have a defined commitment, which describes their objectives.</p><h4>Product Backlog</h4><p>It is a list of what needs to be done in order to deliver or improve the product. It is created and overseen by the Scrum Team, where Product Owner specifies the Product Goal and the Development Team refines it.</p><p>Product Backlog is constantly updating. That means its item are modified or new items are added, depending on situation. When adding or modifying items, Product Backlog refinement should take place. It is the activity of breaking down tasks into smaller, more managable and precise ones, and describing them accordingly in order to achieve transparency.</p><p>Product Backlog items can be assigned a cost. It is a arbitrary value, representing how much work should be done in order to deem it done.</p><p>At the beggining of each Sprint during Sprint planning, all tasks that are deemed to be doable in span of a single Sprint are removed, and put in Sprint Backlog.</p> <p>Product Backlog's commitment is Product Goal. It describes objective that should be achived after clearing Product Backlog. Only one Product Goal should be worked upon at any given time. A necssary thing to remeber is that Product Goals are market-driven. It means they should be set and changed according to market, that is usually to customers needs and requests.</p><h4>Sprint Backlog</h4><p>The Sprint Backlog is a list of all of Product Backlog's items, that could be done in span of a single Sprint. Sprint Backlog items should be detailed enough, so that each Scrum Team member knows what what needs to be achived to finish it.</p><p>Similarly to Product Backlog, Sprint Backlog is constantly updated, as more is learned about the product. However, Sprint Backlog items are mainly monitored and maintained by the Development Team.</p><p>Sprint progress can be measured using Spring Backlog items, as all should be completed in one Sprint. However, some tasks may take longer that others. Here items cost comes in play. During Sprint Planning, total cost of all selected items shouldn't exceed a certain set threshold. This ensures that all tasks can be achived during single Sprint. If the tasks cost is more then the threshold set, the Development Team should consider refining it.</p><p>Commitment of Sprint Backlog is the Sprint Goal. It is a single objective, attainable during the span of a single Sprint. Sprint Goal is created during Sprint Planning, and helps to guide the Development Team towards the desired outcome. Although it shows what should be done, it also provides flexibility. Sometimes, things can go wrong or take unexpected turns. When that happens, the Development Team discuss with Product Owner scope of the Sprint Backlog without interfering with the Sprint Goal.</p><h4>Increment</h4><p>An Increment is the representation of some work done during single Sprint. Each Increment is added to all previous ones, and should provide value on its own as well as work together with other Incremets. With empirical approach, this also means that the Increment should be usable, as to show what was achived.</p><p>All Incremets created during Sprint are presented at the Sprint Review. Incremets then can be delivered as a partial product to customers. They may be delivered also beforehand, as Sprint Review only shows progress made towards Product Goal during single Sprint.</p><p>Increment cannot be considered an Increment, unless it meets the conditions stated in its commitment, Definition of Done.</p><p>Definition of Done, commonly abbrevieted as 'DoD', is a description, what items state is considered done. When Product Backlog item meets its Definition of Done, it is considered then an Increment. When Sprint Backlog item's Definition of Done isn't met, it cannot be delivered or even presented at Sprint Review.</p><p>Definition of Done should be clearly understandable to the whole Scrum Team, as it serves to ensure transparency. As a result, the Developers are required to follow them. This ensures that the whole Development Team has a clear understanding of each item and knows how to make it an Increment.</p>"
    },
    "team": {
        "title": "Team",
        "subtitle": "Who is going to make stuff if not them?",
        "description": "Cross-functional, small teams are the main stars of the Scrum show!",
        "content": "<p>In Scrum, all work is done by the Scrum Team. It consists of one Product Owner, one Scrum Master and the Developers, also collectively called 'Development Team'. There are no other roles, sub-teams or hierarchies. The Scrum Team is a closlely cooperating body of people, that all work towards the Product Goal.</p><p>One of the Scrum Team requirements is its cross-functionality. All members should have skills necessary to create Incremets.</p><p>Another requirement is the Scrum Teams self-management. Each Scrum Team member and the Scrum Team as a whole should manage its time itself, as no superiority hierarchy is defined.</p><p>Product Owner and Scrum Master can serve more then one Scrum Team, but should always be accessible when needed.</p><p>The Scrum Team should be big enough as to be able to finish significant amount of work each Sprint, yet small enough as to not lose its elasticity and nimbleness. The smallest Scrum Team possible consists of three people: one Product Owner, one Scrum Master and one Developer. The maximum amount of Scrum Team members shouldn't exceed 10. If that is a case, then breaking a single team into multiple ones, focused on the same product should be considered.</p><p>In its self-managing, the Scrum Team is also responsible for all that is product-related. From working with customers, product development, experimentation and product maintanace, to anything required to deliver the product.</p><h4>Developers (Development Team)</h4><p>Developers are the people that create Incremets.</p><p>They are responsible for creating and maintaining Sprint Backlog and following the Definition of Done and creating Incremets</p><h4>Product Owner</h4><p>They are responsible for Product Backlog management, which includes creating Product Goal, creating and ordering Product Backlog items and should ensure Product Backlog transparency.</p><p>They may represent clients and are the middleman for communication between them and the Developers. He protects the Developers from clients unnecessary involvment and micromanagement, allowing them to be a self-managing.</p><p>Product Owner can change Product Backlog. If any change is needed, he needs to be convinced that the change is necessary.</p><h4>Scrum Master</h4><p>Scrum Master is the person who ensures, that Scrum and Agile practices are followed by the Scrum Team. He is a Serving Leader, guiding the entire Scrum Team towards understanding Scrum's theorical and practical side.</p><p>He is responsible for the Scrum Team's effectiveness. This responsibility makes incentive for Scrum Master to make efforts to help the Scrum Team boost effectiveness in scope of Scrum and Agile practicies.</p><p>Scrum Master serves the Scrum Team in many ways:<ul><li>coaches team in self-management and cross-functionality</li><li>helps the Scrum Team focus on creating valuable Increments that meet the Definition of Done</li><li>helps the Scrum Team in understanding the need for transparency</li><li>removes any impediments standing before the Scrum Team</li><li>keeps track of time, and ensures productivity during Scrum Events</li><li>removes barriers between clients and the Scrum Team</li></ul>"
    },
    "events": {
        "title": "Events",
        "subtitle": "Regularity is the key!",
        "description": "Minimize number of meetings and make better use of your time!",
        "content": "<p>Scrum Events are opportunities to inspect and modify Scrum artifacts as needed. They are designed in order to ensure transparency. They also create regularity and minimize need for non-Srcum meetings, by maximizing information flow between the Scrum Team members</p><h4>Sprint</h4><p>Sprint is the main event of Scrum. It sets the timeframe for all tasks and activities to be completed in order to provide an Increment. They are of set length, usually a month, but depending on situation and needs, they can vary in length from one week to two months. New Sprint starts just as the previous one ended.</p><p>During the Sprint no changes should be made that would make Sprint Goal obsolete. Quality of the product shouldn't decrese, as a resultant Increment should give a new functionality, not disrupting others. As more is learned about the product, Product and Sprint Backlogs should be refined as need comes. Scope of those can be renegotioated with Product Owner.</p><p>Sprint can be cancelled only by Product Owner, and only when the Sprint Goal becomes obsolete.</p><h4>Sprint Planning</h4><p>The Sprint Planning event initiates a new Sprint, by defining what should be accomplished during the Sprint. It is important for the entire Scrum Team to be present and actively partake, as Sprint Goal is set during this event by the whole Scrum Team.</p><p>During Sprint Planning three topics should be talked about: <b>'What is the Sprint Goal?'</b>, <b>'What can be accomplished during this Sprint?'</b> and <b>'How will the chosen tasks be accomplished?'</b></p><h5>What is the Sprint Goal?</h5><p>Before the end of the Sprint Planning, a transparent Sprint Goal should be created. The Product Owner proposes how products value can be increased, and the Scrum Team defines what the Sprint Goal should look like.</p><h5>What can be accomplished during this Sprint?</h5><p>The Developers discuss with the Product Owner, which Product Backlog items to select for the new Sprint. These items may be refined.</p><p>Selecting Product Backlog items is a difficult task. It boils down to the Developers past experiences and their confidence and proper estimation of their skill. The more the Development Team is experienced, the better they are at estimating.</p><p>One way of selecting Product Backlog items is by using a arbitraty estimate, which is to use assigned costs to items, based on their Definition of Done, estimated time-consumption and complexity. This can be done, for example, by playing Scrum Poker</p><h5>How will the chosen tasks be accomplished?</h5><p>The Developers plan work that needs to be done in order to accomplish the Definition of Done of chosen Product Backlog items. This step is done solely by the Developers, as part of their self-management.</p><h4>Daily Scrum (Stand Up)</h4><p>Daily Scrum are daily meetings, that enforce regularity, help to achieve transparency, track progress towards Sprint Goal and allow inspection and adaptation of Sprint Backlog.</p><p>These meetings, also known as Stand-Ups, should take around 15 minutes. The Developers define how this event is held, as long as the meeting focuses on achieving the Sprint Goal and planning the days work.</p><p>Daily Scrum improve communication, identify any impedimens and are occasion for updates of one's work as part of transparency.</p><h4>Sprint Review</h4><p>Sprint Review is the only time, when the client is directly involved. At this meeting, the Scrum Team presents the Sprint Increments. Client and Scrum Team members review what was accomplished during the sprint, what was changed and what should happen next.</p><p>Important part of Sprint Review is the feedback, that is given by the client. Any requests and possible changes are discussed and may be incorporated into the Product Backlog.</p><p>With a one-month-long Sprint, this meeting shouldn't take longer than 4 hours.</p><h4>Sprint Retrospective</h4><p>In order to increase effectiveness of the Scrum Team, Sprint Retrospectives are organized. They serve as a platform to express their stance towards any interactions and processes that took place.</p><p>Discussed topics are revolving around increasing effectiveness and morale of the team, thus improving the products quality. Any impediments are presented, and ways of dealing with them are discussed. Improvements to the Scrum Team's workflow may also be proposed, discussed and incorporated.</p><p>This is the last scheduled meeting of a Sprint. For a one-month-long Sprint, it shouldn't take longer than 3 hours.</p>"
    },
    "theory": {
        "title": "Theory",
        "subtitle": "Developed based on practice!",
        "description": "Three pillars and reasoning behind them is all it takes!",
        "content": "<p>Scrum was created with focus on empirism. It employs a iterative, incremental aproach in order to boost predictability and lower risk probability.</p><p>Scrum uses Scrum Events for inspection and adaptation. The Events work due to implementation of three Scrum Pillars: transparency, inspection and adaptation.</p><h4>Transparency</h4><p>Transparency in its core is the clear understanding of the target by the Scrum Team. As work is done, everyone must have a unified view of the process and Scrum Artifacts. Artifacts that have low transparency may lead to inconsistencies, increse risk and may even increase workload of the entire team. </p><p>Without transparency, Inspection is meaningless.</p><h4>Inspection</h4><p>Inspecting means to check the state of Scrum Artifacts and progress done towards Product and Sprint Goals. It should be done frequently, as to remove any inconsistencies or solve any resulting problems.</p><p>The Scrum Events were designed so that Inspection can be utilized.</p><p>Without inspection, adaptation is pointless, as nothing can be adapted when the vision isn't clear.</p><h4>Adaptation</h4><p>Whenever any part of a process or product deviate from an expected range, necessary modifications need to take place. Adaptation should take place whenever anything new is learned about the process or the product during inspection.</p>"
    },
    "values": {
        "title": "Values",
        "subtitle": "The big five!",
        "description": "Embody those and make yourself a better team player!",
        "content": "<p>Scrum defines five values, that help the Scrum Team on becoming more proficient in Scrum process.</p><h4>Commitment</h4><p>The Scrum Team is commited to achieving set goals and to support each other.</p><h4>Focus</h4><p>The Scrum Team is focused on their work to achieve the gain best possible progress towards set goals.</p><h4>Openness</h4><p>The Scrum Team and clients are open about the process and the product.</p><h4>Respect</h4><p>Scrum Team members are respectable towards each other.</p><h4>Courage</h4><p>Scrum Team members are courageous to do the right things during the Scrum process.</p>"
    },
    "workflow": {
        "title": "Workflow",
        "subtitle": "How does it all connects?",
        "description": "Wrap your head around the reasoning behind Scrum.",
        "content": "<p>Scrum employ an iterative approach to product development. Scrum workflow runs as follows:</p><ol><li>Product Backlog creation</li>During this meeting Product Goal is set and Product Backlog is created.<li>Sprint</li>This step is repeated until the product isn't finished.<ol><li>Sprint Planning</li>Setting Sprint Goal and creating Sprint Backlog<li>Daily Scrum</li>Daily meetings to keep everyone in team updated.<li>Sprint Review</li>Show the client what you managed to produce during the sprint and get the customers feedback.<li>Sprint Retrospective</li>Give feedback to  your team and improve the way you work.</ol><li>Product delivery</li>Finished product is released!</ol>"
    }
}